# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
print("Найду сумму цифр трехзначного числа. введи: ")
x = str(input());
print(int(x[0]) + int(x[1]) + int(x[2]))
