# Семинар 3. Списки и словари
# Задача No21. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

lst = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},{"VI": "S005"}, {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}]

# result = []
# for item in dictionary:
#     for val in item.values(): # вложенным циклов входим в список по ключам 
#         if val not in result:
#             result.append(val)

# еще решение 2
result = set()

for dct in lst:
    result.add(*dct.values())

print(result)

